/*******************************************************************************************
程序名： 简易电子琴的设计
编写人： 花花雪
编写时间： 2016 年 7月19 日
硬件支持：AT89S52 无源蜂鸣器
接口说明：
修改日志：
NO.1
/*******************************************************************************************
//说明 ：按键控制蜂鸣器发出不同的音阶
			
*******************************************************************************************/
# include <reg52.h>
# include <stdio.h>
# define uchar unsigned char
# define uint unsigned int
sbit buz=P3^6;	  //哪个管脚控制蜂鸣器，buz等于哪个管脚
uchar keycode;	  //各音阶对应计数器的初值：1、2、3、4、5、6、7、1、
/*网页的第五页 ，音阶-频率-周期-计数器初值（参考http://blog.sina.com.cn/s/blog_5c5bb9900100b1ay.html）
http://wenku.baidu.com/link?url=yO9y5kVPWyqH9RDCkZgWJAegJizF1ZipsNy84_ciCDNi3GffZTpicWXwn_rsV1raCzkD3SwC0mjc_FrrHIq49MJxPR4m9vRCmWvhoCG5vNy */
uint code toneh[]={64580,64684,64777, 
64820,64898,64968,65030, 
65058,65110,65157,65178};	   //频率-周期-十六进制
uchar code keymode[8]={0xfe,0xfd,0xfb,0xef,0xdf,0xbf,0x7f};					   //频率-计数器初值
/*******************************************************************************************
函数名：Get_Key()
调  用：Get_Key()
参  数：
返回值：无
结  果：
注  释：
*******************************************************************************************/
uchar Get_Key()
{
  	uchar temp,i;
	P1=0xff;
	temp=P1;
	for(i=0;i<8;i++)
	{
		if (temp==keymode[i])
			return (i);
	}
	return (8);
}
/*******************************************************************************************
函数名：Sys_Init()
调  用：Sys_Init()
参  数：
返回值：无
结  果：
注  释：初始化定时器：工作模式，开启中断
*******************************************************************************************/
void Sys_Init()
{
	TMOD=0x01;	//启动定时器
	EA=1;	//开启总中断
	ET0=1;	//允许定时器1中断
	P1=0xff;	//
}
/*******************************************************************************************
函数名：play(uchar key)
调  用：play(uchar key)
参  数：
返回值：无
结  果：
注  释：
*******************************************************************************************/
void play(uchar key)
{
	if (key==8)
	{
		TR0=0;
		buz=0;
	}
	else
	{
	   	TR0=1;
		keycode=key;
	}
}
/*******************************************************************************************
函数名：play(uchar key)
调  用：play(uchar key)
参  数：
返回值：无
结  果：
注  释：
*******************************************************************************************/
void timer0(void) interrupt 1 using 0		//参考中断函数格式 void 函数名() interrupt 中断号 using 工作组
{
	buz=!buz;
	TH0=toneh[keycode]/256;
	TL0=toneh[keycode]%256;

}

/*******************************************************************************************
函数名：主程序
调  用：
参  数：
返回值：无
结  果：
注  释：
*******************************************************************************************/
void main()
{
  	Sys_Init();
	while(1)
	{
		keycode=Get_Key();
		play(keycode);
	}
   
}